<?php
/**
 * Created by PhpStorm.
 * User: mali@mali
 * Date: 2020/8/6
 * Time: 8:52 下午
 */

namespace app\base\controller;


class ReturnCode
{
    /**
     * @param $code
     * @param $data
     * @param $msg
     */
    static public $return_code = [
        '200' => '操作成功',
        '1001' => '操作成功',
        '1002' => '已锁定', //非法的请求方式 非ajax
        '1003' => '已解锁', //如参数不完整,类型不正确
        '1004' => '请先登陆再访问', //未登录 或者 未授权
        '1005' => '请求授权不符', //非法的请求  无授权查看
        '1006' => '数据加载失败', //
        '1010' => '数据不存在', //
        '1020' => '验证码输入不正确', //
        '1021' => '用户账号或密码错误', //
        '1022' => '用户账号被禁用', //
        '1030' => '数据操作失败', //

        '2002' => '操作失败', //
        '2004' => '商品数据不存在', //
        '2001' => '商品操作失败', //

        '3004' => '余额不足', //


    ];

    /**
     * http 错误号
     * @var int[]
     */
    static public $http_code = [
        '200' => 200,
        '1001' => 200,
        '1002' => 200, //非法的请求方式 非ajax
        '1003' => 200, //如参数不完整,类型不正确
        '1004' => 500, //未登录 或者 未授权
        '1005' => 500, ////非法的请求  无授权查看
        '1006' => 404, //
        '1010' => 200, //
        '1020' => 500, //
        '1021' => 500, //
        '1022' => 500, //
        '1030' => 500, //

        '2002' => 500,//
        '3001' => 200,//
        '3004' => 200,//
    ];
}